### Dataframes
* Dataframe are 2D data structure with columns.
* These columns may contains a different types of Dataframe.
* Think a dataframe just like a spread sheet
* axis = 0 - refers to the index
* axis = 1 - refers to the columns

In [1]:
import pandas as pd

In [8]:
# If you want to create a dictionary into dataframe
sample_dict = {
    'car' : ["audi", 'ferrari', 'lambo'],
    'sold' : [5, 3, 1]
        }
# so values of dic must have a list of values then only it will create a DF.
pd.DataFrame(sample_dict)

       car  sold
0     audi     5
1  ferrari     3
2    lambo     1

In [2]:
# If it doesn't have a list of values then?
# then we need to define that dictionary as a list in that dataframe
some_dict = {
    "Name": "Ashish Porwal",
    "Age": 26,
    "Occupation": "ETL developer"
}
some_dict

{'Name': 'Ashish Porwal', 'Age': 26, 'Occupation': 'ETL developer'}

In [10]:
# converting above dict into a dataframe.
# Note: above dictionary isn't a list of value
other_df = pd.DataFrame([some_dict])
other_df

            Name  Age     Occupation
0  Ashish Porwal   26  ETL developer

In [19]:
# lets try to get the Series using a column name
print(other_df['Age'])

# Or we can directly access that column with dot notation
other_df.Age # but in this way if some column name matched with pandas method name then it is going to prioritize it.

0    26
Name: Age, dtype: int64

0    26
Name: Age, dtype: int64

In [17]:
# While making a Dataframe we can even set indexes, columns
df = pd.DataFrame(data=[[11,22,33], [123,456,798]],
                 index=['First_list', 'Second_list'],
                 columns=["Column1", "Column2", "Column3"]) # column should be equal to the length of a list in data
df

             Column1  Column2  Column3
First_list        11       22       33
Second_list      123      456      798

In [22]:
# lets read Toprichest csv file
df = pd.read_csv("../1_Series/TopRichestInWorld.csv")
df

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
...,...,...,...,...,...,...
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

In [23]:
# If we just want to know how many rows and columns are there
df.shape # returns (rows, column)

(101, 6)

In [26]:
df.size # This returns total elements in our dataframe,
# Above returned 606 because in our dataframe we have 101 rows and 6 columns
# so total elements will be 101*6 = 606.
# And yes it count NaN values too.

606

In [27]:
# To know the index range
df.index

RangeIndex(start=0, stop=101, step=1)

In [28]:
# To know what are the columns available in a dataframe
df.columns

Index(['Name', 'NetWorth', 'Age', 'Country/Territory', 'Source', 'Industry'], dtype='object')

In [32]:
df.axes # This returns a list of info about both indexes and column

[RangeIndex(start=0, stop=101, step=1),
 Index(['Name', 'NetWorth', 'Age', 'Country/Territory', 'Source', 'Industry'], dtype='object')]

In [34]:
df.dtypes # if you want to know what datatype each column got

Name                 object
NetWorth             object
Age                   int64
Country/Territory    object
Source               object
Industry             object
dtype: object

In [39]:
# to know all the value in our dataframe
df.values # This returns a whole row in array

array([['Elon Musk', '$219,000,000,000', 50, 'United States',
        'Tesla, SpaceX', 'Automotive'],
       ['Jeff Bezos', '$171,000,000,000', 58, 'United States', 'Amazon',
        'Technology'],
       ['Bernard Arnault & family', '$158,000,000,000', 73, 'France',
        'LVMH', 'Fashion & Retail'],
       ['Bill Gates', '$129,000,000,000', 66, 'United States',
        'Microsoft', 'Technology'],
       ['Warren Buffett', '$118,000,000,000', 91, 'United States',
        'Berkshire Hathaway', 'Finance & Investments'],
       ['Larry Page', '$111,000,000,000', 49, 'United States', 'Google',
        'Technology'],
       ['Sergey Brin', '$107,000,000,000', 48, 'United States', 'Google',
        'Technology'],
       ['Larry Ellison', '$106,000,000,000', 77, 'United States',
        'software', 'Technology'],
       ['Steve Ballmer', '$91,400,000,000', 66, 'United States',
        'Microsoft', 'Technology'],
       ['Mukesh Ambani', '$90,700,000,000', 64, 'India', 'diversified',
        'Diversified'],
       ['Gautam Adani & family', '$90,000,000,000', 59, 'India',
        'infrastructure, commodities', 'Diversified'],
       ['Michael Bloomberg', '$82,000,000,000', 80, 'United States',
        'Bloomberg LP', 'Media & Entertainment'],
       ['Carlos Slim Helu & family', '$81,200,000,000', 82, 'Mexico',
        'telecom', 'Telecom'],
       ['Francoise Bettencourt Meyers & family', '$74,800,000,000', 68,
        'France', "L'Oréal", 'Fashion & Retail'],
       ['Mark Zuckerberg', '$67,300,000,000', 37, 'United States',
        'Facebook', 'Technology'],
       ['Jim Walton', '$66,200,000,000', 73, 'United States', 'Walmart',
        'Fashion & Retail'],
       ['Zhong Shanshan', '$65,700,000,000', 67, 'China',
        'beverages, pharmaceuticals', 'Food & Beverage'],
       ['Alice Walton', '$65,300,000,000', 72, 'United States',
        'Walmart', 'Fashion & Retail'],
       ['Rob Walton', '$65,000,000,000', 77, 'United States', 'Walmart',
        'Fashion & Retail'],
       ['Changpeng Zhao', '$65,000,000,000', 44, 'Canada',
        'cryptocurrency exchange', 'Finance & Investments'],
       ['Charles Koch', '$60,000,000,000', 86, 'United States',
        'Koch Industries', 'Diversified'],
       ['Julia Koch & family', '$60,000,000,000', 59, 'United States',
        'Koch Industries', 'Diversified'],
       ['Amancio Ortega', '$59,600,000,000', 86, 'Spain', 'Zara',
        'Fashion & Retail'],
       ['Michael Dell', '$55,100,000,000', 57, 'United States',
        'Dell computers', 'Technology'],
       ['Zhang Yiming', '$50,000,000,000', 38, 'China', 'TikTok',
        'Media & Entertainment'],
       ['David Thomson & family', '$49,200,000,000', 64, 'Canada',
        'media', 'Media & Entertainment'],
       ['Phil Knight & family', '$47,300,000,000', 84, 'United States',
        'Nike', 'Fashion & Retail'],
       ['Dieter Schwarz', '$47,100,000,000', 82, 'Germany', 'retail',
        'Fashion & Retail'],
       ['Robin Zeng', '$44,800,000,000', 53, 'Hong Kong', 'batteries',
        'Automotive'],
       ['MacKenzie Scott', '$43,600,000,000', 51, 'United States',
        'Amazon', 'Technology'],
       ['Rodolphe Saadé & family', '$41,400,000,000', 52, 'France',
        'shipping', 'Logistics'],
       ['François Pinault & family', '$40,400,000,000', 85, 'France',
        'luxury goods', 'Fashion & Retail'],
       ['Klaus-Michael Kuehne', '$37,300,000,000', 84, 'Germany',
        'shipping', 'Logistics'],
       ['Ma Huateng', '$37,200,000,000', 50, 'China', 'internet media',
        'Technology'],
       ['Beate Heister & Karl Albrecht Jr. & family', '$36,800,000,000',
        50, 'Germany', 'supermarkets', 'Fashion & Retail'],
       ['Giovanni Ferrero', '$36,200,000,000', 57, 'Italy',
        'Nutella, chocolates', 'Food & Beverage'],
       ['Li Ka-shing', '$34,800,000,000', 93, 'Hong Kong', 'diversified',
        'Diversified'],
       ['Stephen Schwarzman', '$34,800,000,000', 75, 'United States',
        'investments', 'Finance & Investments'],
       ['Lee Shau Kee', '$32,600,000,000', 94, 'Hong Kong',
        'real estate', 'Real Estate'],
       ['Len Blavatnik', '$32,500,000,000', 64, 'United States',
        'music, chemicals', 'Diversified'],
       ['Jacqueline Mars', '$31,700,000,000', 82, 'United States',
        'candy, pet food', 'Food & Beverage'],
       ['John Mars', '$31,700,000,000', 86, 'United States',
        'candy, pet food', 'Food & Beverage'],
       ['Alain Wertheimer', '$31,200,000,000', 73, 'France', 'Chanel',
        'Fashion & Retail'],
       ['Gerard Wertheimer', '$31,200,000,000', 71, 'France', 'Chanel',
        'Fashion & Retail'],
       ['German Larrea Mota Velasco & family', '$30,800,000,000', 68,
        'Mexico', 'mining', 'Metals & Mining'],
       ['Gina Rinehart', '$30,200,000,000', 68, 'Australia', 'mining',
        'Metals & Mining'],
       ['Shiv Nadar', '$28,700,000,000', 76, 'India',
        'software services', 'Technology'],
       ['Jim Simons', '$28,600,000,000', 83, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['He Xiangjian', '$28,300,000,000', 79, 'China',
        'home appliances', 'Manufacturing'],
       ['Miriam Adelson', '$27,500,000,000', 76, 'United States',
        'casinos', 'Gambling & Casinos'],
       ['Dietrich Mateschitz', '$27,400,000,000', 77, 'Austria',
        'Red Bull', 'Food & Beverage'],
       ['Leonardo Del Vecchio & family', '$27,300,000,000', 86, 'Italy',
        'eyeglasses', 'Fashion & Retail'],
       ['Ken Griffin', '$27,200,000,000', 53, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['Tadashi Yanai & family', '$26,100,000,000', 73, 'Japan',
        'fashion retail', 'Fashion & Retail'],
       ['William Lei Ding', '$25,200,000,000', 50, 'China',
        'online games', 'Technology'],
       ['Susanne Klatten', '$24,300,000,000', 59, 'Germany',
        'BMW, pharmaceuticals', 'Automotive'],
       ['Cyrus Poonawalla', '$24,300,000,000', 80, 'India', 'vaccines',
        'Healthcare'],
       ['Wang Wei', '$24,300,000,000', 51, 'China', 'package delivery',
        'Service'],
       ['Qin Yinglin', '$24,100,000,000', 56, 'China', 'pig breeding',
        'Food & Beverage'],
       ['Sam Bankman-Fried', '$24,000,000,000', 30, 'United States',
        'cryptocurrency exchange', 'Finance & Investments'],
       ['Takemitsu Takizaki', '$23,900,000,000', 76, 'Japan', 'sensors',
        'Manufacturing'],
       ['Li Shufu', '$23,700,000,000', 58, 'China', 'automobiles',
        'Automotive'],
       ['Emmanuel Besnier', '$23,500,000,000', 51, 'France', 'cheese',
        'Food & Beverage'],
       ['R. Budi Hartono', '$23,200,000,000', 81, 'Indonesia',
        'banking, tobacco', 'Finance & Investments'],
       ['Leonard Lauder', '$23,100,000,000', 89, 'United States',
        'Estee Lauder', 'Fashion & Retail'],
       ['Guillaume Pousaz', '$23,000,000,000', 40, 'Switzerland',
        'fintech', 'Finance & Investments'],
       ['Iris Fontbona & family', '$22,800,000,000', 79, 'Chile',
        'mining', 'Metals & Mining'],
       ['Jack Ma', '$22,800,000,000', 57, 'China', 'e-commerce',
        'Technology'],
       ['Michael Hartono', '$22,300,000,000', 82, 'Indonesia',
        'banking, tobacco', 'Manufacturing'],
       ['Eric Schmidt', '$22,100,000,000', 66, 'United States', 'Google',
        'Technology'],
       ['Ray Dalio', '$22,000,000,000', 72, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['Daniel Gilbert', '$22,000,000,000', 60, 'United States',
        'Quicken Loans', 'Finance & Investments'],
       ['Thomas Frist, Jr. & family', '$21,800,000,000', 83,
        'United States', 'hospitals', 'Healthcare'],
       ['Masayoshi Son', '$21,300,000,000', 64, 'Japan',
        'internet, telecom', 'Telecom'],
       ['Abigail Johnson', '$21,200,000,000', 60, 'United States',
        'money management', 'Finance & Investments'],
       ['Rupert Murdoch & family', '$20,800,000,000', 91,
        'United States', 'newspapers, TV network',
        'Media & Entertainment'],
       ['Stefan Quandt', '$20,700,000,000', 55, 'Germany', 'BMW',
        'Automotive'],
       ['Jensen Huang', '$20,600,000,000', 59, 'United States',
        'semiconductors', 'Technology'],
       ['Huang Shilin', '$20,300,000,000', 55, 'China', 'batteries',
        'Automotive'],
       ['Thomas Peterffy', '$20,100,000,000', 77, 'United States',
        'discount brokerage', 'Finance & Investments'],
       ['Radhakishan Damani', '$20,000,000,000', 67, 'India',
        'retail, investments', 'Fashion & Retail'],
       ['Pang Kang', '$19,600,000,000', 66, 'China', 'soy sauce',
        'Food & Beverage'],
       ['Wang Chuanfu', '$19,500,000,000', 56, 'China',
        'batteries, automobiles', 'Automotive'],
       ['Reinhold Wuerth & family', '$19,000,000,000', 86, 'Germany',
        'fasteners', 'Manufacturing'],
       ['Theo Albrecht, Jr. & family', '$18,700,000,000', 71, 'Germany',
        "Aldi, Trader Joe's", 'Fashion & Retail'],
       ['Yang Huiyan & family', '$18,700,000,000', 40, 'China',
        'real estate', 'Real Estate'],
       ['Vladimir Lisin', '$18,400,000,000', 65, 'Russia',
        'steel, transport', 'Metals & Mining'],
       ['Fan Hongwei & family', '$18,200,000,000', 55, 'China',
        'petrochemicals', 'Energy'],
       ['Lakshmi Mittal', '$17,900,000,000', 71, 'India', 'steel',
        'Metals & Mining'],
       ['Andrew Forrest', '$17,800,000,000', 60, 'Australia', 'mining',
        'Metals & Mining'],
       ['Jiang Rensheng & family', '$17,700,000,000', 68, 'China',
        'vaccines', 'Healthcare'],
       ['Savitri Jindal & family', '$17,700,000,000', 72, 'India',
        'steel', 'Metals & Mining'],
       ['Wang Wenyin', '$17,700,000,000', 54, 'China',
        'mining, copper products', 'Metals & Mining'],
       ['Li Xiting', '$17,600,000,000', 71, 'Singapore',
        'medical devices', 'Healthcare'],
       ['Stefan Persson', '$17,600,000,000', 74, 'Sweden', 'H&M',
        'Fashion & Retail'],
       ['Steve Cohen', '$17,400,000,000', 65, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['Vladimir Potanin', '$17,300,000,000', 61, 'Russia', 'metals',
        'Metals & Mining'],
       ['Harold Hamm & family', '$17,200,000,000', 76, 'United States',
        'oil & gas', 'Energy'],
       ['Sun Piaoyang', '$17,100,000,000', 63, 'China',
        'pharmaceuticals', 'Healthcare'],
       ['Luo Liguo & family', '$17,000,000,000', 66, 'China',
        'chemicals', 'Manufacturing'],
       ['Peter Woo', '$17,000,000,000', 75, 'Hong Kong', 'real estate',
        'Real Estate']], dtype=object)

In [41]:
list(df['Age'].values) # Suppose I wanted a list of all people age and save in a list

[50,
 58,
 73,
 66,
 91,
 49,
 48,
 77,
 66,
 64,
 59,
 80,
 82,
 68,
 37,
 73,
 67,
 72,
 77,
 44,
 86,
 59,
 86,
 57,
 38,
 64,
 84,
 82,
 53,
 51,
 52,
 85,
 84,
 50,
 50,
 57,
 93,
 75,
 94,
 64,
 82,
 86,
 73,
 71,
 68,
 68,
 76,
 83,
 79,
 76,
 77,
 86,
 53,
 73,
 50,
 59,
 80,
 51,
 56,
 30,
 76,
 58,
 51,
 81,
 89,
 40,
 79,
 57,
 82,
 66,
 72,
 60,
 83,
 64,
 60,
 91,
 55,
 59,
 55,
 77,
 67,
 66,
 56,
 86,
 71,
 40,
 65,
 55,
 71,
 60,
 68,
 72,
 54,
 71,
 74,
 65,
 61,
 76,
 63,
 66,
 75]